---

C#Visual BasicVisual C++

Revit 2024 API
---
IFCAnyHandle..::..SetAttribute Method (String, ISet<(Of <(<'Double>)>)>)
IFCAnyHandle Class See Also Send Feedback
---

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public void SetAttribute(
    	string name,
    	ISet<double> values
    )

Visual Basic
---

    Public Sub SetAttribute ( _
    	name As String, _
    	values As ISet(Of Double) _
    )

Visual C++
---

    public:
    void SetAttribute(
    	String^ name,
    	ISet<double>^ values
    )

#### Parameters

name
    Type: System..::..String

values
    Type: System.Collections.Generic..::..ISet<(Of <(<'Double>)>)>

# See Also

IFCAnyHandle Class

SetAttribute Overload

Autodesk.Revit.DB.IFC Namespace